using System;
using System.Text.RegularExpressions;

namespace Task6
{
    //Напишите программу, которая проверяет
    //текстовую строку на соответствие имеющегося в ней текста формату вещественного числа и выводит, в каком формате оно записано.
    class Program
    {
        static void Main(string[] args)
        {
            int count = 0;
            Console.WriteLine("Введите число:");
            string digit = Console.ReadLine();
            //  string pattern = "";
            //  Regex regex = new Regex();
           // if (digit.Contains('-') && digit.Contains('e'))            
            
        }
    }
}
